Revit 2024 API
CeramicType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicType" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum CeramicType
Visual Basic
Public Enumeration CeramicType
Visual C++
public enum class CeramicType
Members
Member name | Description
Ceramic
Porcelain
See Also
Autodesk.Revit.DB.Visual Namespace